OdTfSchemaManagerInterface.Dispose
\details
Destructor for objects of the OdTfSchemaManagerInterface class. Frees allocated resources.

OdTfSchemaManagerInterface.#ctor
\details
Creates a new instance of a Schema Manager interface with default parameters.

OdTfSchemaManagerInterface.unloadSchema(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Unloads a registered schema.
\param schemeName [in] The schema name.

OdTfSchemaManagerInterface.convertSchema(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts an XML schema to the binary format.
\param schemeName [in] The XML schema name.
\remarks
The binary schema is saved with the file type .tsbf in the same folder as the XML schema.

OdTfSchemaManagerInterface.registerSchema(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdTf.SaveType)
\details
Tries to register the XML or binary schema.
\param schemeName [in] The XML or binary schema name.
\param fileType [in] Type of the file. Refer to the OdTf::SaveType enumerated type for the available file types.
\returns The true value if the schema is registered, or false if the schema was registered earlier.

OdTfSchemaManagerInterface.registerSchema(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Tries to register the XML or binary schema.
\param schemeName [in] The XML or binary schema name.
\returns The true value if the schema is registered, or false if the schema was registered earlier.
\remarks
The name of the schema must have a type .tsbf or .txds.

OdTfSchemaManagerInterface
\details
Represents the interface for the Schema Manager.